# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

### Step 2. Import the dataset from the file given in the repo US_Baby_Names_right.csv

In [2]:
baby_names = pd.read_csv("./US_Baby_Names_right.csv ")
baby_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 3. Assign it to a variable called baby_names.

In [ ]:
baby_names = baby_names

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [7]:
del baby_names['Unnamed: 0']
baby_names.head(10)

      Id      Name  Year Gender State  Count
0  11350      Emma  2004      F    AK     62
1  11351   Madison  2004      F    AK     48
2  11352    Hannah  2004      F    AK     46
3  11353     Grace  2004      F    AK     44
4  11354     Emily  2004      F    AK     41
5  11355   Abigail  2004      F    AK     37
6  11356    Olivia  2004      F    AK     33
7  11357  Isabella  2004      F    AK     30
8  11358    Alyssa  2004      F    AK     29
9  11359    Sophia  2004      F    AK     28

### Step 6. Is there more male or female names in the dataset?

In [9]:
num_females = (baby_names['Gender'] == 'F').sum()
num_males = (baby_names['Gender'] == 'M').sum()
if num_females > num_males:
    print(f'There are more Females:{num_females} than males:{num_males}')
else:
    print(f'There are more  males:{num_males} than Females:{num_females}')

There are more Females:558846 than males:457549

### Step 7. Group the dataset by name and assign to names

In [22]:
#Assume group by names and assign the Number of occurances
baby_namesGrouped = baby_names.groupby('Name')['Count'].sum()
baby_namesGrouped_sorted = baby_namesGrouped.sort_values(ascending=False)
baby_namesGrouped_sorted.head(10)

Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
William     197894
Joshua      191551
Sophia      191446
Daniel      191440
Emily       190318
Name: Count, dtype: int64

### Step 8. How many different names exist in the dataset?

In [24]:
print(baby_namesGrouped_sorted.count(), 'names')

17632 names

In [11]:
print(baby_names['Name'].nunique(),"names")

17632 names

### Step 9. What is the name with most occurrences?

In [26]:
print(baby_namesGrouped_sorted.idxmax())

Jacob

### Step 10. How many different names have the least occurrences?

In [34]:
lowest_Occurance = baby_namesGrouped_sorted.min()
lowest_Occurance_names = baby_namesGrouped_sorted[baby_namesGrouped_sorted==lowest_Occurance]
print(len(lowest_Occurance_names),"names")

2578 names

### Step 11. What is the median name occurrence?

In [35]:
print(baby_namesGrouped_sorted.median())

49.0

### Step 12. What is the standard deviation of names?

In [36]:
print(baby_namesGrouped_sorted.std())

11006.069467890571

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [37]:
baby_namesGrouped_sorted.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64